Android 开发的经验之谈
1.使用优秀的开源库，别盲目地选择library

可以节省大量的时间，把更多的精力花在业务逻辑上。

在Github上有许多免费使用的开源库，但是别因为太激动而盲目的使用。

检查library的star数目，越多越好。看看作者时候还创建了其他的一些受欢迎的库。查看issues（打开和关闭的都看），这可以让你对这个library的健壮性和稳定性有更好的了解。

如果你时间充足，你应该深入这个库的代码，看看他到底是否真的值得使用。

你只需要确保它的代码是可靠的、bug不多、高质量的。


2.坐下来，喝杯咖啡，阅读更多的代码
我们在阅读别人代码上花的时间比自己写代码的时间多得多，如果你不是的话，从今天开始做吧。


不管你现在能写出什么样的代码，总是因为在长年累月中你阅读和学习到了什么东西。它只是你已有只是的反映。


Android的伟大之处就在于他是一个完全开源的平台，可以去深入研究这些代码看看它是如何实现framework的；Github中有成千上万的开源库，只需要选择一个看看人家是如何实现的。


3.有良好的编程规范
如果你在一个公司，需要和同时协同工作，那么务必重视这个问题。


编写简短，干净，可读性强的代码可以让你和别人读代码的时候很享受。代码应该读起来像是读故事一样。


4.使用一个恰当的架构
你永远都会庆幸自己从一开始就选择了一个恰当的架构。


5.将APP的分析和优化工作做起来
依赖分析工具分析app不同部分的性能和用例。
写代码与写高性能的代码之间有很大的区别。高性能的代码是指运行速度快，内存和储存消耗更少的代码。
你需要关注应用奔溃、内存泄漏、性能优化等方面。


6.使用git
版本管理从来没有这么舒心过。


7.使用低端手机
高端机会隐藏app的许多缺陷。假设你在UI线程上做了导致卡顿的事情，但是因为手机过于强大可能导致你无法察觉。


8.善于总结经验，提炼出解决方案。


